//=======================================================================================================
//                                                                               Sovetnik_Setka_v1.mq4 //
//                                                                     Copyright © 15.10.2013 Buldakov //
//                                                                                             EUR/USD //
//=======================================================================================================
#property link "buldakov_a@mail.ru"                                                                    //
//=======================================================================================================
//---Задание входных параметров------------------------------------------------------------------------//
double Points;                                                                                         //
//+++ начало блок 1 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=== Задание переменных для работы советника =========================================================//
       int kg              =2;       //Коэффициент гармоники скользящей средней (раз)                  //
extern int Slow_MACD       =18;      //Период медленной скользящей средней (час)                       //
extern int Alfa_min        =2;       //Минимальный угол наклона МА (пт/час)                            //
extern int Alfa_delta      =34;      //Дельта максимального угла наклона МА (пт/час)                   //
extern int Fast_MACD       =1;       //Период быстрой скользящей средней (час)                         //
extern int Slip            =5;       //Проскальзывание (час)                                           //
extern int N_step          =80;      //Начальное расстояние между открытыми сделками (пт)              //
extern int D_step          =80;      //Увеличение расстояния между открытыми сделками (пт)             //
       int Tay             =2;       //Минимальное время между открытием сделок (час)                  //
       int N_max           =5;       //Максимальное возможное количество открытых сделок (шт)          //
//-----------------------------------------------------------------------------------------------------//
       int n_Lots          =1;       //Обьем первой сделки в целых единицах минимального размера лота  //
       int Magic           =220;     //Магическое число ордера                                         //
//+++ конец блок 1 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//---expert initialization function--------------------------------------------------------------------//
int init()                                                                                             //
{Points = MarketInfo (Symbol(), MODE_POINT);                                                           //
return(0);}                                                                                            //
//---expert deinitialization function------------------------------------------------------------------//
int deinit()                                                                                           //
{return(0);}                                                                                           //
//---expert start function-----------------------------------------------------------------------------//
int start()                                                                                            //
{                                                                                                      //
//=== Переменные для работы эксперта ==================================================================//
int cnt,dt,dt_buy,dt_sell;                                                                             //
int Buy_Orders_Time,Sell_Orders_Time,Buy_Orders,Sell_Orders,Orders_all;                                //
int longsignal,shortsignal,trend_up,trend_dn;                                                          //
int up1,up2,dn1,dn2,buy_open,sell_open,Close_all[1];                                                   //
double Lots,profit,Step,price_op;                                                                      //
//+++ начало блок 2 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=== Внутренние переменные ===========================================================================//
int r,j=0;                                                                                             //
double MA_0,MA_1,Fast_0,Fast_1,Slow_0,Slow_1,Alfa;                                                     //
//+++ конец блок 2 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//===Первичные операции================================================================================//
if (! IsTradeAllowed())                            return(0);//разрешено торговать и поток свободен    //
if(Bars<(2*kg*Slow_MACD*60)/Period())              return(0);//Наличие истории на графике              //
if(AccountFreeMargin()<1000 && OrdersTotal()<1)    return(0);//Минимальная сумма на счете              //
//---Считываем время открытия, прибыль и количество по открытым позициям советника---------------------//
Buy_Orders=0;Sell_Orders=0;Orders_all=0;profit=0.0;                                                    //
for (cnt=0;cnt<=(OrdersTotal()-1);cnt=cnt+1)                                                           //
{OrderSelect(cnt, SELECT_BY_POS, MODE_TRADES);                                                         //
if(OrderType()==OP_BUY  && OrderSymbol()==Symbol() && OrderMagicNumber()==Magic)                       //
{Buy_Orders_Time =OrderOpenTime();Buy_Orders =Buy_Orders+1;                                            //
profit=profit+OrderProfit();Orders_all=Orders_all+1;price_op=OrderOpenPrice();}                        //
if(OrderType()==OP_SELL && OrderSymbol()==Symbol() && OrderMagicNumber()==Magic)                       //
{Sell_Orders_Time=OrderOpenTime();Sell_Orders=Sell_Orders+1;                                           //
profit=profit+OrderProfit();Orders_all=Orders_all+1;price_op=OrderOpenPrice();}}                       //
//-----------------------------------------------------------------------------------------------------//
dt_buy =TimeCurrent()-Buy_Orders_Time;                    //Время с момента открытия покупки           //
dt_sell=TimeCurrent()-Sell_Orders_Time;                   //Время с момента открытия продажи           //
dt=dt_buy;                                                                                             //
if (dt_sell<dt_buy) dt=dt_sell;                           //Время с момента открытия последней сделки  //
if (dt<=(10+60*Period()))                      return(0); //Таймаут на открытие торговой операции      //
//+++ начало блок 4 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
r=60/Period();                                            //Количество баров в часе                    //
//---Определение угла наклона MA-----------------------------------------------------------------------//
MA_0=iMA(NULL,0,Slow_MACD*r*kg,0,MODE_SMA,PRICE_OPEN,j);                                               //
MA_1=iMA(NULL,0,Slow_MACD*r*kg,0,MODE_SMA,PRICE_OPEN,j+1);                                             //
Alfa=((MA_0-MA_1)/Point)*r;                                                                            //
//---Сигналы ------------------------------------------------------------------------------------------//
Fast_0=iOsMA(NULL,0,Fast_MACD*r       ,Slow_MACD*r,Slow_MACD*r,PRICE_OPEN,j);                          //
Fast_1=iOsMA(NULL,0,Fast_MACD*r       ,Slow_MACD*r,Slow_MACD*r,PRICE_OPEN,j+1);                        //
Slow_0=iOsMA(NULL,0,(Fast_MACD+Slip)*r,Slow_MACD*r,Slow_MACD*r,PRICE_OPEN,j);                          //
Slow_1=iOsMA(NULL,0,(Fast_MACD+Slip)*r,Slow_MACD*r,Slow_MACD*r,PRICE_OPEN,j+1);                        //
//+++ конец блок 4 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//---Обнуляем сигнал-----------------------------------------------------------------------------------//
if (Orders_all==0)     Close_all[0]=0;            //на закрытие всех сделок.                           //
buy_open=0;sell_open=0;                                                                                //
//-----------------------------------------------------------------------------------------------------//
Step    =MarketInfo(Symbol(),MODE_MINLOT);        //Размер минимального лота.                          //
//---Определяем наличие тренда-------------------------------------------------------------------------//
trend_up=0;trend_dn=0;                                                                                 //
if (Alfa> Alfa_min && Alfa< (Alfa_min+Alfa_delta)                          ) trend_up=1;               //
if (Alfa<-Alfa_min && Alfa>-(Alfa_min+Alfa_delta)                          ) trend_dn=1;               //
//---Условия формирования сигналов---------------------------------------------------------------------//
longsignal=0;shortsignal=0;                                                                            //
if ((Fast_0-Slow_0)>0.0 && (Fast_1-Slow_1)<=0.0                            ) longsignal=1;             //
if ((Fast_0-Slow_0)<0.0 && (Fast_1-Slow_1)>=0.0                            ) shortsignal=1;            //
//-----------------------------------------------------------------------------------------------------//
if (longsignal==1 || shortsignal==1)                                                                   //
{                                                                                                      //
//=== Блок открытия позиций =============================================================================
up1=0;dn1=0;up2=0;dn2=0;                                                                               //
//-----------------------------------------------------------------------------------------------------//
if (longsignal==1  && trend_dn==1 && dt>Tay*3600                           ) up1=1;                    //
if (shortsignal==1 && trend_up==1 && dt>Tay*3600                           ) dn1=1;                    //
//-----------------------------------------------------------------------------------------------------//
if (Orders_all==0                                                          ) up2=1;                    //
if (Orders_all==0                                                          ) dn2=1;                    //
//-----------------------------------------------------------------------------------------------------//
if (Buy_Orders==1  && Open[0]<(price_op-N_step*Point)                      ) up2=1;                    //
if (Sell_Orders==1 && Open[0]>(price_op+N_step*Point)                      ) dn2=1;                    //
//-----------------------------------------------------------------------------------------------------//
if (Buy_Orders>=2  && Open[0]<(price_op-(N_step+D_step*Orders_all)*Point)  ) up2=1;                    //
if (Sell_Orders>=2 && Open[0]>(price_op+(N_step+D_step*Orders_all)*Point)  ) dn2=1;                    //
//-----------------------------------------------------------------------------------------------------//
if (up1==1                  && up2==1                                      ) buy_open=1;               //
if (dn1==1                  && dn2==1                                      ) sell_open=1;              //
//=== Конец блока открытия позиций ======================================================================
//=== Блок закрытия позиций =============================================================================
if (shortsignal==1 && trend_up==1 && profit>0 && Buy_Orders>=1             ) Close_all[0]=1;           //
if (longsignal==1  && trend_dn==1 && profit>0 && Sell_Orders>=1            ) Close_all[0]=1;           //
//=== Конец блока закрытия позиций ======================================================================
//=== Блок задания размера лота =========================================================================
                                                                             Lots=1*n_Lots*Step;       //
if (Orders_all>=2                                                          ) Lots=2*n_Lots*Step;       //
if (Close_all[0]==1                                                        ) Lots=1*n_Lots*Step;       //
//-----------------------------------------------------------------------------------------------------//
}                                                                                                      //
//===Блок исполнения заявок==============================================================================
//---Закрытие всех позиций-----------------------------------------------------------------------------//
for(cnt=(OrdersTotal()-1);cnt>=0;cnt=cnt-1)                                                            //
{OrderSelect(cnt,SELECT_BY_POS,MODE_TRADES);                                                           //
if(Close_all[0]==1    && OrderType()==OP_BUY  && OrderSymbol()==Symbol() && OrderMagicNumber()==Magic) //
{OrderClose(OrderTicket(),OrderLots(),Bid,10,Blue);Sleep(10000);}                 //Закрытие покупок   //
if(Close_all[0]==1    && OrderType()==OP_SELL && OrderSymbol()==Symbol() && OrderMagicNumber()==Magic) //
{OrderClose(OrderTicket(),OrderLots(),Ask,10,Blue);Sleep(10000);}}                //Закрытие продаж    //
//---Открытие позиций----------------------------------------------------------------------------------//
if(Orders_all<N_max)                                                                                   //
{                                                                                                      //
if(buy_open==1)                                                                                        //
{OrderSend(Symbol(),OP_BUY, Lots,Ask,10,0,0,"Buy", Magic,0,Lime);Sleep(1000);}    //Открытие покупок   //
if(sell_open==1)                                                                                       //
{OrderSend(Symbol(),OP_SELL,Lots,Bid,10,0,0,"Sell",Magic,0,Red) ;Sleep(1000);}}   //Открытие продаж    //
//===Конец блока исполнения заявок=======================================================================
return(0);                                                                                             //
}                                                                                                      //
//===Конец программы=====================================================================================